.config/doom/config.org
* Startup customizatio
I'd like the initial scratch buffer to be in Org:

#+begin_src emacs-lisp
  (setq initial-major-mode 'org-mode)
#+end_src


Check that =pdf-tools= is installed (otherwise this has to be done manually)
# #+begin_src emacs-lisp
#   (pdf-tools-install)
# #+end_src
** KILL remove $HOME .git from =projectile=
CLOSED: [2024-02-24 Sa 14:55]
# Emacs will assume $HOME is the root of any project living under $HOME. If this
# isn't desired, you will need to remove ".git" from
# `projectile-project-root-files-bottom-up' (a variable), e.g.
# #+begin_src emacs-lisp
# (after! projectile
#   (setq projectile-project-root-files-bottom-up
#         (remove ".git" projectile-project-root-files-bottom-up)))
# #+end_src

** TODO github issue doom-emacs =doom/quickload-session= hook
Always resume the last session → currently doesnt work

# #+begin_src emacs-lisp
#   (add-hook! 'window-setup-hook #'doom/quickload-session)
# #+end_src

* Custom keybindings
Switch faster to other window
add toggling the =org-indent-mode= to the toggle localleader

#+begin_src emacs-lisp
  (map! :leader
        (:prefix-map ("t" . "toggle")
         :desc "org-indent-mode"        "C-i"   #'org-indent-mode))
#+end_src

#+RESULTS:
: org-indent-mode

personalize org-mode keybindings
#+begin_src emacs-lisp
(map! :map my-evil-org-mode-map
      :m "]n"  #'org-next-visible-heading
      :m "[n"  #'org-previous-visible-heading
      :m "]j"  #'org-journal-next-entry
      :m "[j"  #'org-journal-previous-entry
      )

#+end_src

#+RESULTS:

** =doc-view=
#+begin_src emacs-lisp
(map! :after doc-view
      :map doc-view-mode-map
      :nmv "C-d" #'doc-view-scroll-down-or-previous-page
      :nmv "C-u" #'doc-view-scroll-up-or-next-page)
(after! doc-view
  (setq doc-view-continuous t))
#+end_src

#+RESULTS:



* Org-mode
set the =org-directory=
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/org")
#+END_SRC

I like seeing a little downward-pointing arrow instead of the usual ellipsis
(=...=) that org displays when there's stuff under a header.

#+begin_src emacs-lisp
(after! org
  (setq org-ellipsis "↴"))
#+end_src

* org-babel
** display ansi colors correctly

Unfortunately, there is a bug with displaying ansi colors correctly:
https://github.com/nnicandro/emacs-jupyter/issues/366

The following hook should take care of that:

#+BEGIN_SRC emacs-lisp
  (defun display-ansi-colors ()
    (ansi-color-apply-on-region (point-min) (point-max)))

  (add-hook 'org-babel-after-execute-hook #'display-ansi-colors)
#+END_SRC

#+RESULTS:
| display-ansi-colors | +org-redisplay-inline-images-in-babel-result-h |

# #+begin_src emacs-lisp
#   (setq jupyter-use-zmq nil)
# #+end_src

# #+RESULTS:
** WAIT setup =ob-tmux= and helper functions

# #+BEGIN_SRC emacs-lisp
#   (use-package ob-tmux
#     ;; Install package automatically (optional)
#     :custom
#     (org-babel-default-header-args:tmux
#      '((:results . "silent")	;
#        (:session . "default")	; The default tmux session to send code to
#        (:socket  . nil)))		; The default tmux socket to communicate with
#     ;; The tmux sessions are prefixed with the following string.
#     ;; You can customize this if you like.
#     (org-babel-tmux-session-prefix "ob-")
#     ;; The terminal that will be used.
#     ;; You can also customize the options passed to the terminal.
#     ;; The default terminal is "gnome-terminal" with options "--".
#     (org-babel-tmux-terminal "xterm")
#     (org-babel-tmux-terminal-opts '("-T" "ob-tmux" "-e"))
#     ;; Finally, if your tmux is not in your $PATH for whatever reason, you
#     ;; may set the path to the tmux binary as follows:
#     (org-babel-tmux-location "/usr/local/bin/tmux"))
# #+END_SRC

# I was involved in improving =ob-tmux= by testing the following code. It allows
# to use =org-babel-open-src-block-result= in a special way to print the output
# back to org. For background see [[https://github.com/ahendriksen/ob-tmux/issues/6][this issue]].

# #+BEGIN_SRC emacs-lisp
#   (defun ob-tmux--insert-result ()
#     (interactive)
#     (let ((info (org-babel-get-src-block-info 'light)))
#       (when (and info (string-equal "tmux" (nth 0 info)))
#         (let* ((params (nth 2 info))
#                (org-session (cdr (assq :session params)))
#                (socket (cdr (assq :socket params)))
#                (socket (when socket (expand-file-name socket)))
#                (ob-session (ob-tmux--from-org-session org-session socket)))
#           (org-babel-insert-result
#                (ob-tmux--execute-string ob-session
#                                         "capture-pane"
#                                         "-p" ;; print to stdout

#                                         "-t" (ob-tmux--session ob-session))
#                '("replace"))))))

#   (defun ob-tmux--edit-result ()
#     (interactive)
#     (pcase (org-babel-get-src-block-info 'light)
#       (`(,_ ,_ ,arguments ,_ ,_ ,start ,_)
#        (save-excursion
#          ;; Go to the results, if there aren't any then run the block.
#          (goto-char start)
#          (goto-char (or (org-babel-where-is-src-block-result)
#                         (progn (org-babel-execute-src-block)
#                                (org-babel-where-is-src-block-result))))
#          (end-of-line)
#          (skip-chars-forward " \r\t\n")
#          (org-edit-special)
#          (delete-trailing-whitespace)
#          (end-of-buffer)
#          t))
#       (_ nil)))

#   (defun ob-tmux--open-src-block-result (orig-fun &rest args)
#     (let ((info (org-babel-get-src-block-info 'light)))
#       (if (and info (string-equal "tmux" (nth 0 info)))
#           (progn
#             (ob-tmux--insert-result)
#             (ob-tmux--edit-result))
#         (apply orig-fun args))))

#   (advice-add 'org-babel-open-src-block-result
#               :around #'ob-tmux--open-src-block-result)
# #+END_SRC

** give org-babel source blocks background colors

They are derived from [[https://github.com/ozh/github-colors/blob/master/colors.json][Github's scholor schemes]] for languages and can be easily
edited using [[https://htmlcolorcodes.com/color-picker/][this tool]].

#+BEGIN_SRC emacs-lisp
  (setq org-src-block-faces '(("emacs-lisp" (:background "#482652"))
                              ("sh" (:background "#223814"))
                              ("tmux" (:background "#324725"))
                              ("python" (:background "#611d1d"))
                              ("jupyter-python" (:background "#371703"))
                              ("jupyter-R" (:background "#281b69"))
                              ;; ("jupyter-python" (:background "#FFFFFF"))
                              ))
#+END_SRC

#+RESULTS:
| emacs-lisp     | (:background #482652) |
| sh             | (:background #223814) |
| tmux           | (:background #324725) |
| python         | (:background #611d1d) |
| jupyter-python | (:background #371703) |
| jupyter-R      | (:background #281b69) |
** use =rainbow-identifiers-mode= to color variables by hash

Turn it on automatically in most programming modes.

#+BEGIN_SRC emacs-lisp
  (add-hook 'prog-mode-hook 'rainbow-identifiers-mode)

#+END_SRC

#+RESULTS:
| rainbow-identifiers-mode | hl-todo-mode | +corfu-add-cape-file-h | display-line-numbers-mode | highlight-numbers-mode | vi-tilde-fringe-mode |

* dap-mode and dab-python (debugger)
- Documentation for dap-python:
  - [[https://github.com/microsoft/debugpy/][adapter]]
  - [[https://emacs-lsp.github.io/dap-mode/page/configuration/#python][dap-mode configuration]]

By default, DAP expects [[https://github.com/Microsoft/ptvsd][ptvsd]] as the Python debugger, but [[https://github.com/microsoft/debugpy][debugpy]] is
recommended. See [[*Configuration][Configuration]].
#+begin_src emacs-lisp
(after! dap-mode
  (setq dap-python-debugger 'debugpy))
#+end_src
* org-todo

I want to customize the doom emacs built-in TODO keywords. Specifically, for me
a =NEXT= state was missing. Also, I want org to log the time for the DONE states
(here: =DONE= and =KILL=)

#+begin_src emacs-lisp
  (after! org
    (setq org-todo-keywords
          '((sequence
             "TODO(t)"  ; A task that needs doing & is ready to do
             "PROJ(p)"  ; A project, which usually contains other tasks
             "LOOP(r)"  ; A recurring task
             "STRT(s)"  ; A task that is in progress
             "NEXT(e)"  ; The next task after the current TODO is done
             "WAIT(w)"  ; Something external is holding up this task
             "HOLD(h)"  ; This task is paused/on hold because of me
             "IDEA(i)"  ; An unconfirmed and unapproved task or notion
             "|"
             "DONE(d)"  ; Task successfully completed
             "KILL(k)") ; Task was cancelled, aborted or is no longer applicable
            (sequence
             "[ ](T)"   ; A task that needs doing
             "[-](S)"   ; Task is in progress
             "[?](W)"   ; Task is being held up or paused
             "|"
             "[X](D)")  ; Task was completed
            (sequence
             "|"
             "OKAY(o)"
             "YES(y)"
             "NO(n)")))
    (setq org-log-done t))

#+end_src

* org-agenda

Customize which files belong in the agenda:

#+begin_src emacs-lisp
  (setq org-agenda-files
        (append
         (directory-files-recursively "~/org/projects/" ".org$")
         (directory-files-recursively "~/org/journal/" "[0-9]+$")
         (directory-files-recursively "~/org/00_roam2/" ".org$")
         '("~org/index.org"
           "~org/recurring-events.org")))
#+end_src

#+RESULTS:
| ~/org/projects/blog-ideas.org | ~/org/projects/dim-forschung.org | ~/org/projects/dim-lehre.org | ~/org/projects/dim-technik.org | ~/org/projects/dim-verwaltung-technik.org | ~/org/projects/divmed.org | ~/org/projects/eggeling.org | ~/org/projects/life.org | ~/org/projects/medinetz-jena.org | ~/org/projects/music-ideas.org | ~/org/projects/reading-list.org | ~/org/projects/rls-kritmint.org | ~/org/projects/sgz-quer.org | ~/org/journal/20230801 | ~/org/journal/20230901 | ~/org/journal/20231001 | ~/org/journal/20231101 | ~/org/journal/20231201 | ~/org/journal/20240101 | ~/org/journal/20240201 | ~/org/journal/20240301 | ~/org/journal/20240401 | ~/org/journal/20240501 | ~/org/journal/20240601 | ~/org/journal/20240701 | ~/org/journal/20240801 | ~/org/journal/20240901 | ~/org/journal/20241001 | ~/org/journal/20241101 | ~/org/journal/20241201 | ~/org/journal/20241202 | ~/org/journal/20250101 | ~/org/00_roam2/daily/2025-01-11.org | ~/org/00_roam2/20241231155159-init.org | ~/org/00_roam2/20250109134019-anova.org | ~/org/00_roam2/20250109134049-statistical_tests.org | ~/org/00_roam2/20250109142817-maths_and_statistics.org | ~/org/00_roam2/20250109145642-statistics_t_test.org | ~/org/00_roam2/20250109150110-wilcoxon_test.org | ~/org/00_roam2/20250109150226-chi_square.org | ~/org/00_roam2/20250109150249-binomial_test.org | ~/org/00_roam2/20250109150359-mann_whitney_test.org | ~/org/00_roam2/20250109150428-fishers_test.org | ~/org/00_roam2/20250109150542-log_rank_test.org | ~/org/00_roam2/20250109150600-mantel_haenszel_test.org | ~/org/00_roam2/20250109150706-mcnemars_test.org | ~/org/00_roam2/20250109150748-hazard_regression.org | ~/org/00_roam2/20250109150958-tukey_kramer_test.org | ~/org/00_roam2/20250109151058-bartletts_test.org | ~/org/00_roam2/20250109151143-kruskal_wallis_test.org | ~/org/00_roam2/20250109151600-friedman_test.org | ~/org/00_roam2/20250109151637-cochrane_s_q_test.org | ~/org/00_roam2/20250109151759-pearson_correlation.org | ~/org/00_roam2/20250109151858-spearman_correlation.org | ~/org/00_roam2/20250109152008-contingency_coefficients.org | ~/org/00_roam2/20250109152040-linear_regression.org | ~/org/00_roam2/20250109152157-nonlinear_regression.org | ~/org/00_roam2/20250109152220-nonparametric_regression.org | ~/org/00_roam2/20250109152258-logistic_regression.org | ~/org/00_roam2/20250109152836-maihda_analysis.org | ~/org/00_roam2/20250109153050-intersectional_research_methods.org | ~/org/00_roam2/20250109153143-progress_plus_framework.org | ~/org/00_roam2/20250109153243-diversity_medicine.org | ~/org/00_roam2/20250109153318-intersectionality.org | ~/org/00_roam2/20250109153920-german_diabetes_risk_score.org | ~/org/00_roam2/20250109154122-diabetes_mellitus.org | ~/org/00_roam2/20250109154150-internal_medicine.org | ~/org/00_roam2/20250109154231-medical_sciences.org | ~org/index.org | ~org/recurring-events.org |

* org-journal

I want a monthly journal and a custom journal directory.
For infos on the time string format:
http://doc.endlessparentheses.com/Fun/format-time-stringhttp://doc.endlessparentheses.com/Fun/format-time-string

#+begin_src emacs-lisp
  (after! org-journal
    (setq org-journal-dir "~/org/journal/")
    (setq org-journal-file-type `monthly)
    (setq org-journal-date-format "%A, %d %B %Y"))
#+end_src

also add some custom keybindings for org-journal functions to calendar mode

#+begin_src emacs-lisp
(map!
 (:map calendar-mode-map
   :n "o" #'org-journal-display-entry
   :n "p" #'org-journal-previous-entry
   :n "n" #'org-journal-next-entry
   :n "O" #'org-journal-new-date-entry))

#+end_src

#+RESULTS:

* org-clock
I want the total time in the duration variable be given in hours and minutes
(not days and hours)
#+begin_src emacs-lisp
(after! org
  (setq org-duration-format 'h:mm))
#+end_src

#+RESULTS:
: h:mm

