.config/doom/config.el
(setq initial-major-mode 'org-mode)

(pdf-tools-install)

(map! :leader
      (:prefix-map ("t" . "toggle")
       :desc "org-indent-mode"        "C-i"   #'org-indent-mode))

(setq org-directory "~/org")

(after! org
  (setq org-ellipsis "↴"))

(setq org-src-block-faces '(("emacs-lisp" (:background "#482652"))
                            ("sh" (:background "#223814"))
                            ("tmux" (:background "#324725"))
                            ("python" (:background "#142b3e"))
                            ("jupyter-python" (:background "#371703"))
                            ;; ("jupyter-python" (:background "#FFFFFF"))
                            ))

(after! dap-mode
  (setq dap-python-debugger 'debugpy))

(after! org
  (setq org-todo-keywords
        '((sequence
           "TODO(t)"  ; A task that needs doing & is ready to do
           "PROJ(p)"  ; A project, which usually contains other tasks
           "LOOP(r)"  ; A recurring task
           "STRT(s)"  ; A task that is in progress
           "NEXT(e)"  ; The next task after the current TODO is done
           "WAIT(w)"  ; Something external is holding up this task
           "HOLD(h)"  ; This task is paused/on hold because of me
           "IDEA(i)"  ; An unconfirmed and unapproved task or notion
           "|"
           "DONE(d)"  ; Task successfully completed
           "KILL(k)") ; Task was cancelled, aborted or is no longer applicable
          (sequence
           "[ ](T)"   ; A task that needs doing
           "[-](S)"   ; Task is in progress
           "[?](W)"   ; Task is being held up or paused
           "|"
           "[X](D)")  ; Task was completed
          (sequence
           "|"
           "OKAY(o)"
           "YES(y)"
           "NO(n)")))
  (setq org-log-done t))

(setq org-agenda-files
      (append
       (directory-files-recursively "~/org/projects/" ".org$")
       '("~org/index.org"
         "~org/recurring-events.org")))

(after! org-journal
  (setq org-journal-dir "~/org/journal/")
  (setq org-journal-file-type `monthly)
  (setq org-journal-date-format "%A, %d %B %Y"))

(after! org
  (setq org-duration-format 'h:mm))

(after! deft
