.config/doom/config.org
* org-roam
Here is the official documentation:
https://github.com/org-roam/org-roam/blob/main/doc/org-roam.org

First, setup the org-roam directory

#+begin_src emacs-lisp
(setq org-roam-directory (file-truename "~/org/00_roam2"))
#+end_src

#+RESULTS:
: /home/lea/org/00_roam2

Next, we setup Org-roam to run functions on file changes to maintain cache
consistency. This is achieved by running M-x org-roam-db-autosync-mode. To
ensure that Org-roam is available on startup, place this in your Emacs
configuration:

#+begin_src emacs-lisp
(org-roam-db-autosync-mode)
#+end_src

The following customizes the org roam buffer, a window on the right which shows
relationships with other notes. For configuration, there are currently 3
provided widget types:

- Backlinks: View (preview of) nodes that link to this node
- Reference Links: Nodes that reference this node (see Refs)
- Unlinked references: View nodes that contain text that match the nodes
  title/alias but are not linked

I want them all

#+begin_src emacs-lisp
(setq org-roam-mode-sections
      (list #'org-roam-backlinks-section
            #'org-roam-reflinks-section
            #'org-roam-unlinked-references-section
            ))
#+end_src

Also, the author's recommended display configuration:

#+begin_src emacs-lisp
(add-to-list 'display-buffer-alist
             '("\\*org-roam\\*"
               (display-buffer-in-direction)
               (direction . right)
               (window-width . 0.33)
               (window-height . fit-window-to-buffer)))
#+end_src

* org-transclusion
#+begin_src emacs-lisp
(use-package! org-transclusion
  :after org
  :init
  (map!
   :map org-transclusion-map
   :leader
   (:prefix ("n" . "notes")
            (:prefix ("i" . "transclusion")
                     :desc "add transcluded text at point" :nvme "a" #'org-transclusion-add
                     :desc "add all active transclusions in buffer" :nvme "A" #'org-transclusion-add-all
                     :desc "make transclusion from link at point" :nvme "l" #'org-transclusion-make-from-link
                     :desc "remove transcluded text at point" :nvme "r" #'org-transclusion-remove
                     :desc "remove all transcluded text in buffer" :nvme "R" #'org-transclusion-remove-all
                     :desc "open source of transclusion at point" :nvme "o" #'org-transclusion-open-source
                     :desc "move to source of transclusion at point" :nvme "O" #'org-transclusion-move-to-source
                     :desc "Org Transclusion Mode" :nvme "t" #'org-transclusion-mode
                     :desc "activate transclusion setup in buffer" :nvme "C-a" #'org-transclusion-activate
                     :desc "deactivate transclusion setup in buffer" :nvme "C-d" #'org-transclusion-deactivate
                     :desc "demote transcluded subtree at point" :nvme "C-h" #'org-transclusion-demote-subtree
                     :desc "promote transcluded subtree at point" :nvme "C-l" #'org-transclusion-promote-subtree
                     :desc "exit live-sync edit at point" :nvme "C-e" #'org-transclusion-live-sync-exit
                     :desc "start live-sync edit at point" :nvme "C-s" #'org-transclusion-live-sync-start
                     :desc "paste to live-sync edit " :nvme "C-p" #'org-transclusion-live-sync-paste
                     )
            )
   )
  )

#+end_src

#+RESULTS:
: org-transclusion

one problem that arises with transcluded =emacs-jupyter= source blocks is that
=org-ctrl-c-ctrl-c= fails with the message "Text is read only!". In [[https:github.com/nobiot/org-transclusion/issues/86][this issue]]
they discussed a workaround

#+begin_src emacs-lisp
(defun my/org-ctrl-c-ctrl-c ()
  (interactive)
  (setq inhibit-read-only t)
  (org-ctrl-c-ctrl-c)
  (setq inhibit-read-only nil))

(map!
 :after org
 :map org-mode-map
 "C-c C-c" #'my/org-ctrl-c-ctrl-c
 )

#+end_src


* TODO org-export - check if still necessary (it's in =packages.el=)
I want to add the twitter bootstrap export to the org export dialogue


#+begin_src emacs-lisp
(use-package! ox-twbs
  :after ox)
#+end_src
* Zetteldeft
#+begin_src emacs-lisp :results silent
(after! deft
  (setq deft-default-extension "org")
  (setq deft-extensions '("org" "md" "txt"))
  (setq deft-use-filename-as-title t)
  (setq deft-directory "~/org/00_zd")
  (setq deft-auto-save-interval 60)
  )
#+end_src

Firstly, deft works only inside a =deft-dir=, which is set above. then start deft.

A Zettelkasten system has no fixed single hierarchy, but it is often convenient
to maintain a base or home note.
Such a note provides structure: it can link to other notes, which in turn
gathers links to notes on a specific theme.

In any case, moving to the home note should be easy, which is where
=zetteldeft-go-home= comes in, accessible with =C-c d h=.

For this to work, you need to first store a note ID in =zetteldeft-home-id=.
For this knowledge base, we could do the following:

#+begin_src emacs-lisp
(defun zetteldeft-go-home ()
  "Move to a designated home note.
Set `zetteldeft-home-id' to an ID string of your home note."
  (interactive)
  (if (stringp zetteldeft-home-id)
      (zetteldeft-find-file
        (zetteldeft--id-to-full-path zetteldeft-home-id))
    (message "No home set. Provide a string to zetteldeft-home-id.")))

(after! zetteldeft
  (setq zetteldeft-home-id "2021-11-30-2245")
  )

(setq zetteldeft-home-id "2021-11-30-2245")
#+end_src

If you have large sets of notes, =deft-refresh= can take a while.
One way to speed things up is to temporarily increase Emacs' garbage collection threshold.

#+begin_src emacs-lisp
;(defun zd-dir-big ()
;  (interactive)
;  (let ((gc-cons-threshold most-positive-fixnum))
;    (deft)
;    (setq deft-directory "~/zd-big/")
;    (deft-refresh)))
#+end_src

Now add some keybindings:

#+begin_src emacs-lisp
(map! :map zetteldeft-map
      :leader
      (:prefix ("d" . "zettel")
                :desc "deft"            :nvme "d" #'deft
                :desc "new search"      :nvme "D" #'zetteldeft-deft-new-search
                :desc "refresh"         :nvme "R" #'deft-refresh
                :desc "search at point" :nvme "s" #'zetteldeft-search-at-point
                :desc "search current id" :nvme "c" #'zetteldeft-search-current-id
                :desc "follow link"     :nvme "f" #'zetteldeft-follow-link
                :desc "avy file other window" :nvme "F" #'zetteldeft-avy-file-search-ace-window
                :desc "browse"          :nvme "." #'zetteldeft-browse
                :desc "go home"         :nvme "h" #'zetteldeft-go-home
                :desc "avy link search" :nvme "l" #'zetteldeft-avy-link-search
                :desc "insert list of links" :nvme "L" #'zetteldeft-insert-list-links-block
                :desc "avy tag search"  :nvme "t" #'zetteldeft-avy-tag-search
                :desc "tag list"        :nvme "T" #'zetteldeft-tag-buffer
                :desc "insert tag"      :nvme "#" #'zetteldeft-tag-insert
                :desc "remove tag"      :nvme "$" #'zetteldeft-tag-remove
                :desc "search tag"      :nvme "/" #'zetteldeft-search-tag
                :desc "insert id"       :nvme "i" #'zetteldeft-find-file-id-insert
                :desc "insert id full search" :nvme "C-i" #'zetteldeft-full-search-id-insert
                :desc "insert full title" :nvme "I" #'zetteldeft-find-file-full-title-insert
                :desc "insert title full search" :nvme "C-I" #'zetteldeft-full-search-full-title-insert
                :desc "find file"       :nvme "o" #'zetteldeft-find-file
                :desc "new file"        :nvme "n" #'zetteldeft-new-file
                :desc "new file & link" :nvme "N" #'zetteldeft-new-file-and-link
                :desc "new file & backlink" :nvme "B" #'zetteldeft-new-file-and-backlink
                :desc "add backlink"    :nvme "b" #'zetteldeft-backlink-add
                :desc "rename"          :nvme "r" #'zetteldeft-file-rename
                :desc "count words"     :nvme "x" #'zetteldeft-count-words
                )
      )

#+end_src

* Optimize citations with =zotxt-emacs= and Zotero integration
zotxt-emacs works with zotxt to provide Emacs integration with Zotero, allowing
you to manage citation keys for pandoc markdown documents as well as org mode
links to items in your Zotero collection.

Note: on Github this project is called https://github.com/egh/zotxt-emacs and
shouldn't be confused with the zotero extension with the same name which this
emacs mode is using (https://github.com/egh/zotxt)

To insert a link to a reference into a org-mode document, first enable the
=org-zotxt= minor mode. To insert citation keys into a markdown document (for
use with =pandoc=), first enable =zotxt-citekey= minor mode (see =** Editing
with Markdown=)

#+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook #'org-zotxt-mode)
  (add-hook 'org-mode-hook #'org-zotxt-mode)

#+END_SRC

Now add some keybindings:

#+begin_src emacs-lisp
(map! :map zotxt-map
      :leader
      (:prefix ("z" . "zotero")
                :desc "org insert item"         :nvme "i" #'org-zotxt-insert-reference-link
                :desc "org update link here"    :nvme "u" #'org-zotxt-update-reference-link-at-point
                :desc "org update all links"    :nvme "U" #'org-zotxt-update-all-reference-links
                :desc "org open attachment"     :nvme "a" #'org-zotxt-open-attachment
                :desc "insert citekey"          :nvme "k" #'zotxt-citekey-insert
                :desc "select citekey in Zotero" :nvme "s" #'zotxt-citekey-select-item-at-point
                )
      )

#+end_src


for org-mode:
- Then you can use: =C-c " i= (=org-zotxt-insert-reference-link=) to insert an
  item.
- To update the current link text at point to reflect changed metadata from
  Zotero, use =C-c " u= (=org-zotxt-update-reference-link-at-point=).
- To open an attachment of the link at point, use =C-c " a=
  (=org-zotxt-open-attachment=)

  for markdown:
  - Then you can use: =C-c " k= (=zotxt-citekey-insert=) to insert a citation
    key.
  - You can also use =complete-at-point= to complete the citekey. For example, if
    you type =@doe= =M-x completion-at-point=, you will be presented with a list of
    completions. In =markdown-mode= this is not bound to any key sequence, but
    you can of course bind it as you would like.
  - See zotxt website for instructions on using =pandoc-zotxt.lua= to
    automatically connect to a running Zotero instance to fetch citation data
    when using pandoc.

Lastly, we want the inserted links with the form
=zotero://select/library/items/ZJGPX6KU= to open with Zotero

#+begin_src emacs-lisp
  (defun zotero-open (zotero-link)
    (start-process "zotero_open" nil "open" (concat "zotero:" zotero-link)))

  (after! ol
    (org-link-set-parameters "zotero" :follow #'zotero-open))

#+end_src

#+RESULTS:
| :follow | zotero-open | :export | org-zotxt--link-export |

* fine-tuning =init.el= - rainbow mode

first, use rainbow mode in org-mode

#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'rainbow-mode)
#+end_src

=hl-line-mode= overrides the color highlighting of =rainbow-mode=, limiting the
use of that plugin and on-site color changes using =kurecolor=. To automatically
disable it only when =rainbow-mode= is active, you can add the following hook:

#+begin_src emacs-lisp

(add-hook! 'rainbow-mode-hook
  (hl-line-mode (if rainbow-mode -1 +1)))
#+end_src
